In [10]:
import pandas as pd
import numpy as np

sout_1 = pd.Series([1, 4, 10, np.nan ])
sout_1

0     1.0
1     4.0
2    10.0
3     NaN
dtype: float64

In [12]:
df = pd.DataFrame(
    {
        "Name": [
            "Braund, Mr. Owen Harris",
            "Allen, Mr. William Henry",
            "Bonnell, Miss. Elizabeth",
        ],
        "Age": [22, 35, 58],
        "Sex": ["male", "male", "female"],
    }
)

In [13]:
df

                       Name  Age     Sex
0   Braund, Mr. Owen Harris   22    male
1  Allen, Mr. William Henry   35    male
2  Bonnell, Miss. Elizabeth   58  female